---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NotFamilyFile
source: html/2b4df3e1-93cc-a24b-93a5-e2064d48d0d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.NotFamilyFile Property

The selected file is not a Family File.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotFamilyFile { get; }
```